{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "templateId": null,
  "displayName": "ACME - APP - SESSION - O365 - Timeoutsettings",
  "state": "enabledForReportingButNotEnforced",
  "deletedDateTime": null,
  "grantControls": null,
  "partialEnablementStrategy": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser"
    ],
    "locations": null,
    "times": null,
    "deviceStates": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "Office365"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [
        "895b3e04-1f55-413d-a3f8-5a23678310ae",
        "4815e4bf-84a2-45e5-8f36-8ceb030cd25a"
      ],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "platforms": {
      "includePlatforms": [
        "all"
      ],
      "excludePlatforms": [
        "android",
        "iOS",
        "macOS",
        "linux"
      ]
    },
    "devices": {
      "includeDeviceStates": [],
      "excludeDeviceStates": [],
      "includeDevices": [],
      "excludeDevices": [],
      "deviceFilter": {
        "mode": "exclude",
        "rule": "device.isCompliant -eq True -and device.trustType -eq \"ServerAD\""
      }
    }
  },
  "sessionControls": {
    "disableResilienceDefaults": null,
    "cloudAppSecurity": null,
    "signInFrequency": null,
    "persistentBrowser": null,
    "continuousAccessEvaluation": null,
    "secureSignInSession": null,
    "applicationEnforcedRestrictions": {
      "isEnabled": true
    }
  }
}