{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "templateId": null,
  "displayName": "ACME - APP - GRANT - MFA - AVDUsers",
  "state": "enabled",
  "deletedDateTime": null,
  "partialEnablementStrategy": null,
  "sessionControls": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "9cdead84-a844-4324-93f2-b2e6bb768d07",
        "270efc09-cd0d-444b-a71f-39af4910ec45",
        "a4a365df-50f1-4397-bc59-1a1564b8bb9c",
        "0af06dc6-e4b5-4f28-818e-e78e62d137a5"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "f16362af-c155-4692-bfc6-fcca34527737",
        "10e8cb66-8623-4c4d-bc10-47383c03523f"
      ],
      "excludeGroups": [
        "895b3e04-1f55-413d-a3f8-5a23678310ae"
      ],
      "includeRoles": [],
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('b1fe8b5d-8d8a-441a-9475-9235ee176838')/grantControls/authenticationStrength/$entity",
    "authenticationStrength": null
  }
}